; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v13 ?v9)
             (pred_2 ?v5 ?v11)
             (pred_4 ?v13 ?v11)
             (pred_11 ?v8 ?v13 )
	     (pred_1 ?v13)
             (pred_5 ?v2)
             (pred_7 ?v5)
             (pred_8 ?v11)
             (pred_6 ?v13)
             (pred_9 ?v5)
             (pred_10 ?v13)
             (pred_12 ))



(:action op_4
:parameters (?v10 ?v7 ?v3 ?v1)
:precondition (and (pred_5 ?v10) (pred_5 ?v7) (pred_7 ?v3) (pred_8 ?v1)
          (pred_3 ?v10 ?v7) (pred_2 ?v3 ?v1)
                   (pred_4 ?v7 ?v1) (pred_1 ?v10) 
                   (pred_6 ?v7) (pred_9 ?v3))
:effect (and  (pred_10 ?v7) (not (pred_6 ?v7))))


(:action op_5
:parameters (?v10 ?v4)
:precondition (and (pred_5 ?v10) (pred_5 ?v4)
               (pred_1 ?v10) (pred_3 ?v10 ?v4) (pred_10 ?v4))
:effect (and (pred_1 ?v4) (not (pred_1 ?v10))))

(:action op_1
:parameters (?v10 ?v3)
:precondition (and (pred_5 ?v10) (pred_7 ?v3) 
                  (pred_1 ?v10) (pred_11 ?v3 ?v10) (pred_12 ))
:effect (and (pred_9 ?v3)
   (not (pred_11 ?v3 ?v10)) (not (pred_12 ))))


(:action op_3
:parameters (?v10 ?v12 ?v6)
:precondition (and (pred_5 ?v10) (pred_7 ?v12) (pred_7 ?v6)
                  (pred_1 ?v10) (pred_9 ?v6) (pred_11 ?v12 ?v10))
:effect (and (pred_9 ?v12) (pred_11 ?v6 ?v10)
        (not (pred_9 ?v6)) (not (pred_11 ?v12 ?v10))))

(:action op_2
:parameters (?v10 ?v3)
:precondition (and (pred_5 ?v10) (pred_7 ?v3) 
                  (pred_1 ?v10) (pred_9 ?v3))
:effect (and (pred_12 ) (pred_11 ?v3 ?v10) (not (pred_9 ?v3)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_23 obj_02 obj_27 obj_20 obj_04 obj_16 obj_09 obj_25 obj_13 obj_22 obj_15 obj_29 obj_12 obj_08 obj_19 obj_21 obj_31 obj_05 obj_24 obj_28 obj_26 obj_14 obj_03 obj_07
    obj_30 obj_18 obj_06
    obj_11 obj_01 obj_17
    )

    (:init
       (pred_12)

       (pred_5 obj_10)
       (pred_5 obj_23)
       (pred_5 obj_02)
       (pred_5 obj_27)
       (pred_5 obj_20)
       (pred_5 obj_04)
       (pred_5 obj_16)
       (pred_5 obj_09)
       (pred_5 obj_25)
       (pred_5 obj_13)
       (pred_5 obj_22)
       (pred_5 obj_15)
       (pred_5 obj_29)
       (pred_5 obj_12)
       (pred_5 obj_08)
       (pred_5 obj_19)
       (pred_5 obj_21)
       (pred_5 obj_31)
       (pred_5 obj_05)
       (pred_5 obj_24)
       (pred_5 obj_28)
       (pred_5 obj_26)
       (pred_5 obj_14)
       (pred_5 obj_03)
       (pred_5 obj_07)
       (pred_8 obj_30)
       (pred_8 obj_18)
       (pred_8 obj_06)
       (pred_7 obj_11)
       (pred_7 obj_01)
       (pred_7 obj_17)

       (pred_3 obj_10 obj_04)
       (pred_3 obj_10 obj_23)
       (pred_3 obj_23 obj_16)
       (pred_3 obj_23 obj_02)
       (pred_3 obj_23 obj_10)
       (pred_3 obj_02 obj_09)
       (pred_3 obj_02 obj_27)
       (pred_3 obj_02 obj_23)
       (pred_3 obj_27 obj_25)
       (pred_3 obj_27 obj_20)
       (pred_3 obj_27 obj_02)
       (pred_3 obj_20 obj_13)
       (pred_3 obj_20 obj_27)
       (pred_3 obj_04 obj_22)
       (pred_3 obj_04 obj_16)
       (pred_3 obj_04 obj_10)
       (pred_3 obj_16 obj_15)
       (pred_3 obj_16 obj_09)
       (pred_3 obj_16 obj_23)
       (pred_3 obj_16 obj_04)
       (pred_3 obj_09 obj_29)
       (pred_3 obj_09 obj_25)
       (pred_3 obj_09 obj_02)
       (pred_3 obj_09 obj_16)
       (pred_3 obj_25 obj_12)
       (pred_3 obj_25 obj_13)
       (pred_3 obj_25 obj_27)
       (pred_3 obj_25 obj_09)
       (pred_3 obj_13 obj_08)
       (pred_3 obj_13 obj_20)
       (pred_3 obj_13 obj_25)
       (pred_3 obj_22 obj_19)
       (pred_3 obj_22 obj_15)
       (pred_3 obj_22 obj_04)
       (pred_3 obj_15 obj_21)
       (pred_3 obj_15 obj_29)
       (pred_3 obj_15 obj_16)
       (pred_3 obj_15 obj_22)
       (pred_3 obj_29 obj_31)
       (pred_3 obj_29 obj_12)
       (pred_3 obj_29 obj_09)
       (pred_3 obj_29 obj_15)
       (pred_3 obj_12 obj_05)
       (pred_3 obj_12 obj_08)
       (pred_3 obj_12 obj_25)
       (pred_3 obj_12 obj_29)
       (pred_3 obj_08 obj_24)
       (pred_3 obj_08 obj_13)
       (pred_3 obj_08 obj_12)
       (pred_3 obj_19 obj_28)
       (pred_3 obj_19 obj_21)
       (pred_3 obj_19 obj_22)
       (pred_3 obj_21 obj_26)
       (pred_3 obj_21 obj_31)
       (pred_3 obj_21 obj_15)
       (pred_3 obj_21 obj_19)
       (pred_3 obj_31 obj_14)
       (pred_3 obj_31 obj_05)
       (pred_3 obj_31 obj_29)
       (pred_3 obj_31 obj_21)
       (pred_3 obj_05 obj_03)
       (pred_3 obj_05 obj_24)
       (pred_3 obj_05 obj_12)
       (pred_3 obj_05 obj_31)
       (pred_3 obj_24 obj_07)
       (pred_3 obj_24 obj_08)
       (pred_3 obj_24 obj_05)
       (pred_3 obj_28 obj_26)
       (pred_3 obj_28 obj_19)
       (pred_3 obj_26 obj_14)
       (pred_3 obj_26 obj_21)
       (pred_3 obj_26 obj_28)
       (pred_3 obj_14 obj_03)
       (pred_3 obj_14 obj_31)
       (pred_3 obj_14 obj_26)
       (pred_3 obj_03 obj_07)
       (pred_3 obj_03 obj_05)
       (pred_3 obj_03 obj_14)
       (pred_3 obj_07 obj_24)
       (pred_3 obj_07 obj_03)
       (pred_6 obj_21)
       (pred_6 obj_23)
       (pred_6 obj_22)
       (pred_4  obj_21 obj_30)
       (pred_4  obj_23 obj_18)
       (pred_4  obj_22 obj_06)
       (pred_10 obj_10)
       (pred_10 obj_02)
       (pred_10 obj_27)
       (pred_10 obj_20)
       (pred_10 obj_04)
       (pred_10 obj_16)
       (pred_10 obj_09)
       (pred_10 obj_25)
       (pred_10 obj_13)
       (pred_10 obj_15)
       (pred_10 obj_29)
       (pred_10 obj_12)
       (pred_10 obj_08)
       (pred_10 obj_19)
       (pred_10 obj_31)
       (pred_10 obj_05)
       (pred_10 obj_24)
       (pred_10 obj_28)
       (pred_10 obj_26)
       (pred_10 obj_14)
       (pred_10 obj_03)
       (pred_10 obj_07)

       (pred_2  obj_11 obj_30)
       (pred_2  obj_01 obj_18)
       (pred_2  obj_17 obj_06)
       (pred_11 obj_11 obj_08)
       (pred_11 obj_01 obj_14)
       (pred_11 obj_17 obj_15)
       (pred_1 obj_09)
    )

    (:goal (and
       (pred_11 obj_11 obj_12)
       (pred_11 obj_17 obj_12)
    ))
(:constraints
  (always (not (pred_1 obj_29)))
)
)

; plan
1. (op_5 obj_09 obj_16)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_16)
   goals met: 0 of 2
2. (op_5 obj_16 obj_15)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_15)
   goals met: 0 of 2
3. (op_1 obj_15 obj_17)
   deleted: (pred_11 obj_17 obj_15) (pred_12)
   added: (pred_9 obj_17)
   goals met: 0 of 2
4. (op_5 obj_15 obj_16)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_16)
   goals met: 0 of 2
5. (op_5 obj_16 obj_09)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_09)
   goals met: 0 of 2
6. (op_5 obj_09 obj_25)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_25)
   goals met: 0 of 2
7. (op_5 obj_25 obj_12)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_12)
   goals met: 0 of 2
8. (op_2 obj_12 obj_17)
   deleted: (pred_9 obj_17)
   added: (pred_12) (pred_11 obj_17 obj_12)
   goals met: 1 of 2
9. (op_5 obj_12 obj_08)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_08)
   goals met: 1 of 2
10. (op_1 obj_08 obj_11)
   deleted: (pred_11 obj_11 obj_08) (pred_12)
   added: (pred_9 obj_11)
   goals met: 1 of 2
11. (op_5 obj_08 obj_12)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_12)
   goals met: 1 of 2
12. (op_2 obj_12 obj_11)
   deleted: (pred_9 obj_11)
   added: (pred_12) (pred_11 obj_11 obj_12)
   goals met: 2 of 2
